USE	MusicStore

GO

--************************************************************************************************
--****************************************   ЗАВДАННЯ №2 * ***************************************
--************************************************************************************************

--************************************************************************************************
--Створіть представлення, що оновлюється, яке дозволить
--вставляти нові стилі;

CREATE VIEW [vStyle]
AS
SELECT [S].[Name] AS 'Стилі'
FROM [Style] AS [S]
GO

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vStyle]

--Додавання
INSERT INTO[vStyle] VALUES('Хіп-хоп')
INSERT INTO[vStyle] VALUES('Джаз')
INSERT INTO[vStyle] VALUES('Соул')

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vStyle]
--************************************************************************************************

--************************************************************************************************
--Створіть представлення,що оновлюється, яке дозволить
--вставляти нові пісні;
GO
CREATE VIEW [vSong]
AS
SELECT	[S].[Name] AS 'Назва пісні',
		[S].[IdDisc] AS 'Id диска',
		[S].[Time] AS 'Тривалість пісні',
		[S].[IdArtist] AS 'Id артиста',
		[S].[IdStyle] AS 'Музичний стиль'
FROM [Song] AS [S]
GO

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vSong]
-- ПОДИВИТИСЯ РЕЗУЛЬТАТ у більшому представленні
SELECT [V].[Назва пісні] AS 'Назва пісні',
		[D].[Name] AS 'Диск',
		[V].[Тривалість пісні] AS 'Тривалість пісні',
		[A].[Name] AS 'Артист',
		[S].[Name] AS 'Музичний стиль'
FROM [vSong] AS [V] JOIN [Disc] AS [D] ON [V].[Id диска] = [D].[Id]
	INNER JOIN [Artist] AS [A] ON [A].[Id] = [V].[Id артиста]
	INNER JOIN [Style] AS [S] ON [S].[Id] = [V].[Id диска]

--Додавання
INSERT INTO[vSong] VALUES('Перевірочна пісня 1', 1, '00:03:21', 6, 1)
INSERT INTO[vSong] VALUES('Перевірочна пісня 2', 1, '00:02:21', 4, 1)
--************************************************************************************************
--Створіть представлення, що оновлюється, яке дозволить
--оновлювати інформацію про видавця;

GO
CREATE VIEW [vPublisher]
AS
SELECT	[P].[Name] AS 'Назвa',
		[P].[IdCountry] AS 'Id страни'
FROM [Publisher] AS [P]
GO

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vPublisher]
-- ПОДИВИТИСЯ РЕЗУЛЬТАТ у більшому представленні
SELECT	[V].[Назвa] AS 'Назвa',
		[C].[Name] AS 'Страна'
FROM [vPublisher] AS [V] JOIN [Country] AS [C] ON [V].[Id страни] = [C].[Id]

--Додавання
INSERT INTO[vPublisher] VALUES('Перевірочний видавець 1', 1)
INSERT INTO[vPublisher] VALUES('Перевірочний видавець 2', 2)
INSERT INTO[vPublisher] VALUES('Перевірочний видавець 3', 3)
INSERT INTO[vPublisher] VALUES('Перевірочний видавець 4', 4)
--Оновлення
UPDATE [vPublisher]
SET [Назвa] = 'Юкрейн продакшн',
	[Id страни] = 1
WHERE [Назвa] = 'Перевірочний видавець 1'

UPDATE [vPublisher]
SET [Назвa] = 'MetroMusic',
	[Id страни] = 2
WHERE [Назвa] = 'Перевірочний видавець 2'

--************************************************************************************************

--Створіть представлення,що оновлюється, яке дозволить
--видаляти виконавців;
GO
CREATE VIEW [vArtist]
AS
SELECT	[A].[Name] AS 'Артист'
FROM [Artist] AS [A]
GO

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vArtist]

--Додавання
INSERT INTO[vArtist] VALUES('Виконавець 1')
INSERT INTO[vArtist] VALUES('Виконавець 2')
INSERT INTO[vArtist] VALUES('Виконавець 3')
INSERT INTO[vArtist] VALUES('Виконавець 4')

--Оновлення
UPDATE [vArtist]
SET [Артист] = 'Павло Зібров'
WHERE [Артист] = 'Виконавець 1'
UPDATE [vArtist]
SET [Артист] = 'Дженіс'
WHERE [Артист] = 'Виконавець 2'
UPDATE [vArtist]
SET [Артист] = 'Співаков Андрій'
WHERE [Артист] = 'Виконавець 3'

--Видалення
DELETE
FROM [vArtist]
WHERE [Артист] = 'Співаков Андрій'
DELETE
FROM [vArtist]
WHERE [Артист] = 'Павло Зібров'

--************************************************************************************************
--Створіть представлення, що оновлюється, яке дозволить
--оновлювати інформацію про конкретного виконавця. 
--Наприклад, Muse.

GO
CREATE VIEW [vArtistMuse]
AS
SELECT	[A].[Name] AS 'Артист'
FROM [Artist] AS [A]
WHERE [A].[Name] = 'Muse'
WITH CHECK OPTION
GO

--Додавання (так як такого виконавця не існує у базі)
INSERT INTO[vArtistMuse] VALUES('Muse')

-- ПОДИВИТИСЯ РЕЗУЛЬТАТ
SELECT * FROM [vArtistMuse]

--Апдейт не можливий (так як накладені умови на вьюху)
UPDATE [vArtistMuse]
SET [Артист] = 'Співаков Андрій'
WHERE [Артист] = 'Muse'
